charliermarsh.ruff
christian-kohler.path-intellisense
correiagithubgruvbox.correia-github-gruvbox
danielgavin.ols
grapecity.gc-excelviewer
ms-python.autopep8
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
ms-vscode.cmake-tools
ms-vscode.cpptools
ms-vscode.cpptools-extension-pack
ms-vscode.cpptools-themes
ms-vscode.hexeditor
robole.markdown-snippets
rust-lang.rust-analyzer
shd101wyy.markdown-preview-enhanced
wenhoujx.swiper